apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k146_pinmux.h
/********************************************************************************************
 * arch/arm/src/s32k1xx/hardware/s32k146_pinmux.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K146_PINMUX_H
#define __ARCH_ARM_SRC_S32K1XX_HARDWARE_S32K146_PINMUX_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* In most cases, there are alternative configurations for various pins. Those alternative
 * pins are labeled with a suffix like _1, _2, etc. in order to distinguish them.  Logic in
 * the board.h file must select the correct pin configuration for the board by defining a pin
 * configuration (with no suffix) that maps to the correct alternative.
 *
 * WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * and pull-up/down!  Just the basics are defined for most pins in the initial version of
 * this file.
 */

/* ADC */

#define PIN_ADC0_SE0              (PIN_ANALOG | PIN_PORTA | PIN0)
#define PIN_ADC0_SE1              (PIN_ANALOG | PIN_PORTA | PIN1)
#define PIN_ADC0_SE2              (PIN_ANALOG | PIN_PORTA | PIN6)
#define PIN_ADC0_SE3              (PIN_ANALOG | PIN_PORTA | PIN7)
#define PIN_ADC0_SE4              (PIN_ANALOG | PIN_PORTB | PIN0)
#define PIN_ADC0_SE5              (PIN_ANALOG | PIN_PORTB | PIN1)
#define PIN_ADC0_SE6              (PIN_ANALOG | PIN_PORTB | PIN2)
#define PIN_ADC0_SE7              (PIN_ANALOG | PIN_PORTB | PIN3)
#define PIN_ADC0_SE8_1            (PIN_ANALOG | PIN_PORTB | PIN13)
#define PIN_ADC0_SE8_2            (PIN_ANALOG | PIN_PORTC | PIN0)
#define PIN_ADC0_SE9_1            (PIN_ANALOG | PIN_PORTB | PIN14)
#define PIN_ADC0_SE9_2            (PIN_ANALOG | PIN_PORTC | PIN1)
#define PIN_ADC0_SE10             (PIN_ANALOG | PIN_PORTC | PIN2)
#define PIN_ADC0_SE11             (PIN_ANALOG | PIN_PORTC | PIN3)
#define PIN_ADC0_SE12             (PIN_ANALOG | PIN_PORTC | PIN14)
#define PIN_ADC0_SE13             (PIN_ANALOG | PIN_PORTC | PIN15)
#define PIN_ADC0_SE14             (PIN_ANALOG | PIN_PORTC | PIN16)
#define PIN_ADC0_SE15             (PIN_ANALOG | PIN_PORTC | PIN17)
#define PIN_ADC0_SE16             (PIN_ANALOG | PIN_PORTB | PIN18)
#define PIN_ADC0_SE17             (PIN_ANALOG | PIN_PORTB | PIN20)
#define PIN_ADC0_SE18             (PIN_ANALOG | PIN_PORTB | PIN21)
#define PIN_ADC0_SE19             (PIN_ANALOG | PIN_PORTB | PIN22)
#define PIN_ADC0_SE20             (PIN_ANALOG | PIN_PORTB | PIN23)
#define PIN_ADC0_SE21             (PIN_ANALOG | PIN_PORTB | PIN25)
#define PIN_ADC0_SE22             (PIN_ANALOG | PIN_PORTB | PIN27)
#define PIN_ADC0_SE23             (PIN_ANALOG | PIN_PORTB | PIN28)

#define PIN_ADC1_SE0              (PIN_ANALOG | PIN_PORTA | PIN2)
#define PIN_ADC1_SE1              (PIN_ANALOG | PIN_PORTA | PIN3)
#define PIN_ADC1_SE2              (PIN_ANALOG | PIN_PORTD | PIN2)
#define PIN_ADC1_SE3              (PIN_ANALOG | PIN_PORTD | PIN3)
#define PIN_ADC1_SE4              (PIN_ANALOG | PIN_PORTC | PIN6)
#define PIN_ADC1_SE5              (PIN_ANALOG | PIN_PORTC | PIN7)
#define PIN_ADC1_SE6              (PIN_ANALOG | PIN_PORTD | PIN4)
#define PIN_ADC1_SE7              (PIN_ANALOG | PIN_PORTB | PIN12)
#define PIN_ADC1_SE8              (PIN_ANALOG | PIN_PORTB | PIN13)
#define PIN_ADC1_SE9              (PIN_ANALOG | PIN_PORTB | PIN14)
#define PIN_ADC1_SE10             (PIN_ANALOG | PIN_PORTE | PIN2)
#define PIN_ADC1_SE11             (PIN_ANALOG | PIN_PORTE | PIN6)
#define PIN_ADC1_SE12             (PIN_ANALOG | PIN_PORTA | PIN15)
#define PIN_ADC1_SE13             (PIN_ANALOG | PIN_PORTA | PIN16)
#define PIN_ADC1_SE14_1           (PIN_ANALOG | PIN_PORTB | PIN0)
#define PIN_ADC1_SE14_2           (PIN_ANALOG | PIN_PORTB | PIN15)
#define PIN_ADC1_SE15_1           (PIN_ANALOG | PIN_PORTB | PIN1)
#define PIN_ADC1_SE15_2           (PIN_ANALOG | PIN_PORTB | PIN16)
#define PIN_ADC1_SE16             (PIN_ANALOG | PIN_PORTD | PIN18)
#define PIN_ADC1_SE17             (PIN_ANALOG | PIN_PORTD | PIN19)
#define PIN_ADC1_SE18             (PIN_ANALOG | PIN_PORTD | PIN22)
#define PIN_ADC1_SE19             (PIN_ANALOG | PIN_PORTD | PIN23)
#define PIN_ADC1_SE20             (PIN_ANALOG | PIN_PORTD | PIN24)
#define PIN_ADC1_SE21             (PIN_ANALOG | PIN_PORTD | PIN27)
#define PIN_ADC1_SE22             (PIN_ANALOG | PIN_PORTD | PIN28)
#define PIN_ADC1_SE23             (PIN_ANALOG | PIN_PORTD | PIN29)

/* CAN */

#define PIN_CAN0_RX_1             (PIN_ALT3   | PIN_PORTC | PIN2)
#define PIN_CAN0_RX_2             (PIN_ALT5   | PIN_PORTA | PIN28)
#define PIN_CAN0_RX_3             (PIN_ALT5   | PIN_PORTB | PIN0)
#define PIN_CAN0_RX_4             (PIN_ALT5   | PIN_PORTE | PIN4)
#define PIN_CAN0_TX_1             (PIN_ALT3   | PIN_PORTC | PIN3)
#define PIN_CAN0_TX_2             (PIN_ALT5   | PIN_PORTA | PIN27)
#define PIN_CAN0_TX_3             (PIN_ALT5   | PIN_PORTB | PIN1)
#define PIN_CAN0_TX_4             (PIN_ALT5   | PIN_PORTE | PIN5)

#define PIN_CAN1_RX_1             (PIN_ALT3   | PIN_PORTA | PIN12)
#define PIN_CAN1_RX_2             (PIN_ALT3   | PIN_PORTC | PIN6)
#define PIN_CAN1_TX_1             (PIN_ALT3   | PIN_PORTA | PIN13)
#define PIN_CAN1_TX_2             (PIN_ALT3   | PIN_PORTC | PIN7)

