apache/nuttx/arch/arm/src/s32k1xx/hardware/s32k146_pinmux.h
#define PIN_FTM5_CH0_1            (PIN_ALT2   | PIN_PORTA | PIN25)
#define PIN_FTM5_CH0_2            (PIN_ALT4   | PIN_PORTC | PIN9)
#define PIN_FTM5_CH1_1            (PIN_ALT2   | PIN_PORTA | PIN26)
#define PIN_FTM5_CH1_2            (PIN_ALT4   | PIN_PORTC | PIN8)
#define PIN_FTM5_CH2_1            (PIN_ALT2   | PIN_PORTA | PIN27)
#define PIN_FTM5_CH2_2            (PIN_ALT2   | PIN_PORTC | PIN29)
#define PIN_FTM5_CH3_1            (PIN_ALT2   | PIN_PORTA | PIN28)
#define PIN_FTM5_CH3_2            (PIN_ALT3   | PIN_PORTA | PIN7)
#define PIN_FTM5_CH4_1            (PIN_ALT2   | PIN_PORTA | PIN29)
#define PIN_FTM5_CH4_2            (PIN_ALT2   | PIN_PORTC | PIN30)
#define PIN_FTM5_CH5_1            (PIN_ALT2   | PIN_PORTA | PIN30)
#define PIN_FTM5_CH5_2            (PIN_ALT4   | PIN_PORTA | PIN6)
#define PIN_FTM5_CH6_1            (PIN_ALT2   | PIN_PORTA | PIN31)
#define PIN_FTM5_CH6_2            (PIN_ALT2   | PIN_PORTC | PIN31)
#define PIN_FTM5_CH7_1            (PIN_ALT2   | PIN_PORTB | PIN18)
#define PIN_FTM5_CH7_2            (PIN_ALT2   | PIN_PORTD | PIN18)
#define PIN_FTM5_FLT0_1           (PIN_ALT4   | PIN_PORTE | PIN12)
#define PIN_FTM5_FLT0_2           (PIN_ALT5   | PIN_PORTA | PIN17)
#define PIN_FTM5_FLT1_1           (PIN_ALT4   | PIN_PORTB | PIN17)
#define PIN_FTM5_FLT1_2           (PIN_ALT4   | PIN_PORTD | PIN17)

/* FlexIO */

#define PIN_FXIO_D0_1             (PIN_ALT3   | PIN_PORTC | PIN30)
#define PIN_FXIO_D0_2             (PIN_ALT3   | PIN_PORTD | PIN9)
#define PIN_FXIO_D0_3             (PIN_ALT4   | PIN_PORTA | PIN10)
#define PIN_FXIO_D0_4             (PIN_ALT6   | PIN_PORTD | PIN0)
#define PIN_FXIO_D1_1             (PIN_ALT3   | PIN_PORTC | PIN31)
#define PIN_FXIO_D1_2             (PIN_ALT4   | PIN_PORTA | PIN11)
#define PIN_FXIO_D1_3             (PIN_ALT5   | PIN_PORTD | PIN8)
#define PIN_FXIO_D1_4             (PIN_ALT6   | PIN_PORTD | PIN1)
#define PIN_FXIO_D2_1             (PIN_ALT3   | PIN_PORTD | PIN18)
#define PIN_FXIO_D2_2             (PIN_ALT4   | PIN_PORTA | PIN0)
#define PIN_FXIO_D2_3             (PIN_ALT6   | PIN_PORTE | PIN15)
#define PIN_FXIO_D3_1             (PIN_ALT3   | PIN_PORTD | PIN19)
#define PIN_FXIO_D3_2             (PIN_ALT4   | PIN_PORTA | PIN1)
#define PIN_FXIO_D3_3             (PIN_ALT6   | PIN_PORTE | PIN16)
#define PIN_FXIO_D4_1             (PIN_ALT4   | PIN_PORTD | PIN2)
#define PIN_FXIO_D4_2             (PIN_ALT5   | PIN_PORTA | PIN2)
#define PIN_FXIO_D4_3             (PIN_ALT6   | PIN_PORTE | PIN10)
#define PIN_FXIO_D5_1             (PIN_ALT4   | PIN_PORTD | PIN3)
#define PIN_FXIO_D5_2             (PIN_ALT5   | PIN_PORTA | PIN3)
#define PIN_FXIO_D5_3             (PIN_ALT6   | PIN_PORTE | PIN11)
#define PIN_FXIO_D6_1             (PIN_ALT4   | PIN_PORTA | PIN8)
#define PIN_FXIO_D6_2             (PIN_ALT5   | PIN_PORTD | PIN2)
#define PIN_FXIO_D6_3             (PIN_ALT6   | PIN_PORTE | PIN4)
#define PIN_FXIO_D7_1             (PIN_ALT4   | PIN_PORTA | PIN9)
#define PIN_FXIO_D7_2             (PIN_ALT5   | PIN_PORTD | PIN3)
#define PIN_FXIO_D7_3             (PIN_ALT6   | PIN_PORTE | PIN5)

/* JTAG */

#define PIN_JTAG_TCLK             (PIN_ALT7   | PIN_PORTC | PIN4)
#define PIN_JTAG_TDI              (PIN_ALT7   | PIN_PORTC | PIN5)
#define PIN_JTAG_TDO              (PIN_ALT7   | PIN_PORTA | PIN10)
#define PIN_JTAG_TMS              (PIN_ALT7   | PIN_PORTA | PIN4)

/* LPI2C */

#define PIN_LPI2C0_HREQ_1         (PIN_ALT3   | PIN_PORTB | PIN11)
#define PIN_LPI2C0_HREQ_2         (PIN_ALT3   | PIN_PORTE | PIN1)
#define PIN_LPI2C0_SCL_1          (PIN_ALT2   | PIN_PORTB | PIN7)
#define PIN_LPI2C0_SCL_2          (PIN_ALT3   | PIN_PORTA | PIN3)
#define PIN_LPI2C0_SCLS_1         (PIN_ALT3   | PIN_PORTA | PIN0)
#define PIN_LPI2C0_SCLS_2         (PIN_ALT3   | PIN_PORTB | PIN9)
#define PIN_LPI2C0_SDA_1          (PIN_ALT2   | PIN_PORTB | PIN6)
#define PIN_LPI2C0_SDA_2          (PIN_ALT3   | PIN_PORTA | PIN2)
#define PIN_LPI2C0_SDAS_1         (PIN_ALT3   | PIN_PORTA | PIN1)
#define PIN_LPI2C0_SDAS_2         (PIN_ALT3   | PIN_PORTB | PIN10)
#define PIN_LPSPI0_PCS0_1         (PIN_ALT3   | PIN_PORTB | PIN0)
#define PIN_LPSPI0_PCS0_2         (PIN_ALT4   | PIN_PORTA | PIN26)
#define PIN_LPSPI0_PCS0_3         (PIN_ALT4   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS1_1         (PIN_ALT3   | PIN_PORTB | PIN5)
#define PIN_LPSPI0_PCS1_2         (PIN_ALT4   | PIN_PORTA | PIN31)
#define PIN_LPSPI0_PCS2           (PIN_ALT2   | PIN_PORTE | PIN6)
#define PIN_LPSPI0_PCS3           (PIN_ALT3   | PIN_PORTA | PIN15)
#define PIN_LPSPI0_SCK_1          (PIN_ALT2   | PIN_PORTC | PIN23)
#define PIN_LPSPI0_SCK_2          (PIN_ALT2   | PIN_PORTE | PIN0)
#define PIN_LPSPI0_SCK_3          (PIN_ALT3   | PIN_PORTB | PIN2)
#define PIN_LPSPI0_SCK_4          (PIN_ALT4   | PIN_PORTD | PIN15)
#define PIN_LPSPI0_SIN_1          (PIN_ALT2   | PIN_PORTE | PIN1)
#define PIN_LPSPI0_SIN_2          (PIN_ALT3   | PIN_PORTB | PIN3)
#define PIN_LPSPI0_SIN_3          (PIN_ALT4   | PIN_PORTD | PIN16)
#define PIN_LPSPI0_SOUT_1         (PIN_ALT2   | PIN_PORTE | PIN2)
#define PIN_LPSPI0_SOUT_2         (PIN_ALT3   | PIN_PORTB | PIN1)
#define PIN_LPSPI0_SOUT_3         (PIN_ALT3   | PIN_PORTB | PIN4)
#define PIN_LPSPI0_SOUT_4         (PIN_ALT4   | PIN_PORTA | PIN30)

#define PIN_LPSPI1_PCS0_1         (PIN_ALT3   | PIN_PORTA | PIN26)
#define PIN_LPSPI1_PCS0_2         (PIN_ALT3   | PIN_PORTD | PIN3)
#define PIN_LPSPI1_PCS0_3         (PIN_ALT5   | PIN_PORTE | PIN1)
#define PIN_LPSPI1_PCS1_1         (PIN_ALT3   | PIN_PORTA | PIN6)
#define PIN_LPSPI1_PCS1_2         (PIN_ALT4   | PIN_PORTB | PIN18)
#define PIN_LPSPI1_PCS2           (PIN_ALT3   | PIN_PORTA | PIN16)
#define PIN_LPSPI1_PCS3           (PIN_ALT3   | PIN_PORTB | PIN17)
#define PIN_LPSPI1_SCK_1          (PIN_ALT3   | PIN_PORTA | PIN28)
#define PIN_LPSPI1_SCK_2          (PIN_ALT3   | PIN_PORTB | PIN14)
#define PIN_LPSPI1_SCK_3          (PIN_ALT3   | PIN_PORTD | PIN0)
#define PIN_LPSPI1_SIN_1          (PIN_ALT3   | PIN_PORTB | PIN15)
#define PIN_LPSPI1_SIN_2          (PIN_ALT3   | PIN_PORTD | PIN1)
#define PIN_LPSPI1_SIN_3          (PIN_ALT5   | PIN_PORTA | PIN29)
#define PIN_LPSPI1_SOUT_1         (PIN_ALT3   | PIN_PORTA | PIN27)
#define PIN_LPSPI1_SOUT_2         (PIN_ALT3   | PIN_PORTB | PIN16)
#define PIN_LPSPI1_SOUT_3         (PIN_ALT3   | PIN_PORTD | PIN2)
#define PIN_LPSPI1_SOUT_4         (PIN_ALT5   | PIN_PORTE | PIN0)

